In [2]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

# Series Math

In [3]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser2 = Series([3,4,5,6],index=['A','B','C','D'])
print(ser1)
print(ser2)

A    0
B    1
C    2
dtype: int64
A    3
B    4
C    5
D    6
dtype: int64

In [4]:
#Note the NaN values are added in automatically
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

# Dataframe Math

In [7]:
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [8]:
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [10]:
# better approch
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [12]:
ser3 = dframe2.ix[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [14]:
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

# Ordering

In [15]:
ser1 = Series(range(3),index=['C','A','B'])
ser1

C    0
A    1
B    2
dtype: int64

In [16]:
#Now sort_index
ser1.sort_index()

A    1
B    2
C    0
dtype: int64

In [19]:
#Can sort a Series by its values
ser1.sort_values()

C    0
A    1
B    2
dtype: int64

# Merging

More info: http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.merge.html

In [21]:
dframe1 = DataFrame({'key':['X','Z','Y','Z','X','X'],'data_set_1': np.arange(6)})
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [22]:
dframe2 = DataFrame({'key':['Q','Y','Z'],'data_set_2':[1,2,3]})
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z

In [24]:
# Merge will automatically choose overlapping columns to merge on
# this is a "many-to-one" situation
pd.merge(dframe1,dframe2)

#Note no overlapping 'X's

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [27]:
#choose which DataFrame's keys to use, this will choose left (dframe1)
pd.merge(dframe1,dframe2,on='key',how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z         3.0
2           2   Y         2.0
3           3   Z         3.0
4           4   X         NaN
5           5   X         NaN

In [28]:
pd.merge(dframe1,dframe2,on='key',how='outer')

   data_set_1 key  data_set_2
0         0.0   X         NaN
1         4.0   X         NaN
2         5.0   X         NaN
3         1.0   Z         3.0
4         3.0   Z         3.0
5         2.0   Y         2.0
6         NaN   Q         1.0

In [29]:
#  many to many merge
pd.merge(dframe1, dframe2)

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

# Joins

In [31]:
df_left = DataFrame({'key': ['X','Y','Z','X','Y'],
                  'data': range(5)})
df_right = DataFrame({'group_data': [10, 20]}, index=['X', 'Y'])
print(df_left)
print(df_right)

   data key
0     0   X
1     1   Y
2     2   Z
3     3   X
4     4   Y
   group_data
X          10
Y          20

In [32]:
# use key for left DF and index for the right
pd.merge(df_left,df_right,left_on='key',right_index=True)

   data key  group_data
0     0   X          10
3     3   X          10
1     1   Y          20
4     4   Y          20

In [33]:
# union by using outer
pd.merge(df_left,df_right,left_on='key',right_index=True,how='outer')

   data key  group_data
0     0   X        10.0
3     3   X        10.0
1     1   Y        20.0
4     4   Y        20.0
2     2   Z         NaN

In [39]:
df_left.join(df_right)

   data key  group_data
0     0   X         NaN
1     1   Y         NaN
2     2   Z         NaN
3     3   X         NaN
4     4   Y         NaN

In [40]:
df_right.join(df_left)

   group_data  data  key
X          10   NaN  NaN
Y          20   NaN  NaN

In [34]:
df_left_hr = DataFrame({'key1': ['SF','SF','SF','LA','LA'],
                   'key2': [10, 20, 30, 20, 30],
                   'data_set': np.arange(5.)})
df_right_hr = DataFrame(np.arange(10).reshape((5, 2)),
                   index=[['LA','LA','SF','SF','SF'],
                          [20, 10, 10, 10, 20]],
                   columns=['col_1', 'col_2'])
print(df_left_hr)
print(df_right_hr)

   data_set key1  key2
0       0.0   SF    10
1       1.0   SF    20
2       2.0   SF    30
3       3.0   LA    20
4       4.0   LA    30
       col_1  col_2
LA 20      0      1
   10      2      3
SF 10      4      5
   10      6      7
   20      8      9

In [35]:
# merge the left by using keys and the right by its index
pd.merge(df_left_hr,df_right_hr,left_on=['key1','key2'],right_index=True)

   data_set key1  key2  col_1  col_2
0       0.0   SF    10      4      5
0       0.0   SF    10      6      7
1       1.0   SF    20      8      9
3       3.0   LA    20      0      1

In [36]:
# union by choosing 'outer' method
pd.merge(df_left_hr,df_right_hr,left_on=['key1','key2'],right_index=True,how='outer')

   data_set key1  key2  col_1  col_2
0       0.0   SF    10    4.0    5.0
0       0.0   SF    10    6.0    7.0
1       1.0   SF    20    8.0    9.0
2       2.0   SF    30    NaN    NaN
3       3.0   LA    20    0.0    1.0
4       4.0   LA    30    NaN    NaN
4       NaN   LA    10    2.0    3.0

# Pivoting

In [42]:
import pandas.util.testing as tm; tm.N = 3

#Create a unpivoted function
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    
    # Return the DataFrame
    return DataFrame(data, columns=['date', 'variable', 'value'])

#Set the DataFrame we'll be using
dframe = unpivot(tm.makeTimeDataFrame())
dframe

         date variable     value
0  2000-01-03        A -1.169083
1  2000-01-04        A -0.366271
2  2000-01-05        A -1.343587
3  2000-01-03        B  1.797581
4  2000-01-04        B -0.538593
5  2000-01-05        B -1.380612
6  2000-01-03        C -0.165763
7  2000-01-04        C -0.610586
8  2000-01-05        C -1.180385
9  2000-01-03        D  1.525789
10 2000-01-04        D  0.829548
11 2000-01-05        D -1.181093

In [43]:
# First two value spassed are teh row and column indexes, then finally an optional fill value
dframe_piv = dframe.pivot('date','variable','value')

#Show
dframe_piv

variable           A         B         C         D
date
2000-01-03 -1.169083  1.797581 -0.165763  1.525789
2000-01-04 -0.366271 -0.538593 -0.610586  0.829548
2000-01-05 -1.343587 -1.380612 -1.180385 -1.181093

# Binning

One last thing to note, jus tlike in standard math notation, when setting up bins:
    <br>() means open, while 
    <br>[] means closed/inclusive

In [44]:
years = [1990,1991,1992,2008,2012,2015,1987,1969,2013,2008,1999]
decade_bins = [1960,1970,1980,1990,2000,2010,2020]

In [45]:
#Now we'll use cut to get somethign called a Category object
decade_cat = pd.cut(years,decade_bins)
decade_cat

[(1980, 1990], (1990, 2000], (1990, 2000], (2000, 2010], (2010, 2020], ..., (1980, 1990], (1960, 1970], (2010, 2020], (2000, 2010], (1990, 2000]]
Length: 11
Categories (6, interval[int64]): [(1960, 1970] < (1970, 1980] < (1980, 1990] < (1990, 2000] < (2000, 2010] < (2010, 2020]]

In [46]:
decade_cat.categories

IntervalIndex([(1960, 1970], (1970, 1980], (1980, 1990], (1990, 2000], (2000, 2010], (2010, 2020]]
              closed='right',
              dtype='interval[int64]')

In [47]:
pd.value_counts(decade_cat)

(2010, 2020]    3
(1990, 2000]    3
(2000, 2010]    2
(1980, 1990]    2
(1960, 1970]    1
(1970, 1980]    0
dtype: int64

In [48]:
# pass data values to the cut.
#For instance, if we just wanted to make two bins, evenly spaced based on max and min year, with a 1 year precision
pd.cut(years,2,precision=1)

[(1969.0, 1992.0], (1969.0, 1992.0], (1969.0, 1992.0], (1992.0, 2015.0], (1992.0, 2015.0], ..., (1969.0, 1992.0], (1969.0, 1992.0], (1992.0, 2015.0], (1992.0, 2015.0], (1992.0, 2015.0]]
Length: 11
Categories (2, interval[float64]): [(1969.0, 1992.0] < (1992.0, 2015.0]]

# Group By

In [49]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

   dataset1  dataset2 k1     k2
0 -1.319239 -0.436301  X  alpha
1 -1.460673  0.567785  X   beta
2  0.641394  0.150530  Y  alpha
3 -0.895651  0.500896  Y   beta
4  1.572629  0.530047  Z  alpha

In [61]:
# dataset1 column and group it by the k1 key
group1 = dframe.dataset1.groupby(dframe.k1)
group1

In [62]:
group1.mean()

k1
X   -1.389956
Y   -0.127128
Z    1.572629
Name: dataset1, dtype: float64

In [63]:
#We'll make some arrays for use as keys
cities = np.array(['NY','LA','LA','NY','NY'])
months = np.array(['JAN','FEB','JAN','FEB','JAN'])
# using the data from dataset1, group the means by city and month
dframe.dataset1.groupby([cities,months]).mean()

LA  FEB   -1.460673
    JAN    0.641394
NY  FEB   -0.895651
    JAN    0.126695
Name: dataset1, dtype: float64

In [64]:
#pass column names as group keys
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.389956  0.065742
Y  -0.127128  0.325713
Z   1.572629  0.530047

In [65]:
# multiple column names
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -1.319239 -0.436301
   beta  -1.460673  0.567785
Y  alpha  0.641394  0.150530
   beta  -0.895651  0.500896
Z  alpha  1.572629  0.530047

In [66]:
# groupby method is getting the group sizes
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [68]:
# iterate over groups

#For example:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name)
    print (group)
    print ('\n')

This is the X group
   dataset1  dataset2 k1     k2
0 -1.319239 -0.436301  X  alpha
1 -1.460673  0.567785  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  0.641394  0.150530  Y  alpha
3 -0.895651  0.500896  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  1.572629  0.530047  Z  alpha

In [69]:
animals = DataFrame(np.arange(16).reshape(4, 4),
                   columns=['W', 'X', 'Y', 'Z'],
                   index=['Dog', 'Cat', 'Bird', 'Mouse'])

#Now lets add some NAN values
animals.ix[1:2, ['W', 'Y']] = np.nan 

#Show
animals

C:\Users\Hazz\Anaconda3\envs\untitled2\lib\site-packages\ipykernel_launcher.py:6: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [72]:
behavior_map = {'W': 'good', 'X': 'bad', 'Y': 'good','Z': 'bad'}

In [76]:
#groupby using that mapping
animal_col = animals.groupby(behavior_map, axis=1)

# Show the sum accroding to the groupby with the mapping
animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
Mouse  28.0  26.0

In [78]:
animals.groupby(behavior_map, axis=1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [82]:
animals.groupby(behavior_map, axis=1).describe()

        count      mean       std  min  25%   50%   75%   max
bad  X    4.0  7.000000  5.163978  1.0  4.0   7.0  10.0  13.0
     Z    4.0  9.000000  5.163978  3.0  6.0   9.0  12.0  15.0
good W    3.0  6.666667  6.110101  0.0  4.0   8.0  10.0  12.0
     Y    3.0  8.666667  6.110101  2.0  6.0  10.0  12.0  14.0